ConfigurationSale/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationSale/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ConfigurationSale/src/Documents/РеализацияТоваров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//{{__REGISTER_RECORD_WIZARD
	//This fragment was built by the wizard.
	//Warning! All manually made changes will be lost next time you use the wizard.

	// register ТоварыНаСкладах
	RegisterRecords.ТоварыНаСкладах.Write = True;
	For Each CurRowТовары In Товары Do
		Record = RegisterRecords.ТоварыНаСкладах.Add();
		Record.Period = Date;
		Record.RecordType = AccumulationRecordType.Expense;
		Record.Номенклатура = CurRowТовары.Номенклатура;
		Record.Количество = CurRowТовары.Количество;
	EndDo;

	//}}__REGISTER_RECORD_WIZARD

КонецПроцедуры
